package com.sourceit.homework.RecursionHM;

/**
 * Имеется три стержня, на один из которых нанизаны N колец, причем кольца отличаются размером и лежат меньшее на большем.
 * Требуется перенести пирамиду из N колец с одного стержня на другой за наименьшее число ходов.
 * За один раз разрешается переносить только одно кольцо, причём нельзя класть большее кольцо на меньшее.
 * Created by Still on 19.02.2015.
 */

public class Recursion4 {

        public static void main(String[] args) {
//this commit changes

        }


    }

