package com.sourceit.homework.hw01;

/**
 * Создать класс, который содержит int и char (не проинициализированные) и распечатать их значения.
 * Created by Still on 11.02.2015.
 */
public class A {

    int intValue;
    char charValue;


    public void printValues() {

        System.out.println("Int value: " + intValue);
        System.out.println("Char value: " + charValue);
    }
}